{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/3ba7a56a-314f-4dec-a207-0beb532dde57')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/3ba7a56a-314f-4dec-a207-0beb532dde57')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "_CSGP: Anomalous Service Account Sign in",
                "description": "This rule detects a new service account sign in that has not been previously observed in the past 30 days\nThis is in the early stages - reach out to James for tuning\n\nHandling Guidance: https://costar-group-prod-dev.atlassian.net/wiki/spaces/SCSP/pages/390039244/General+Incident+Report+Handling+Guidance",
                "severity": "Low",
                "enabled": true,
                "query": "// Contributor: James Kim\r\n// Source: NA\r\n// References\r\n// Reviewer: \r\n//\r\n// Description: This rule detects a service account sign-in to a device that has not previously been signed into in a 30d period.\r\n// Handling Guidance: \r\n//\r\n// Query\r\nlet reference = DeviceLogonEvents\r\n| where TimeGenerated > ago(30d) and TimeGenerated < ago(1d)\r\n| where ActionType == \"LogonSuccess\"\r\n| where LogonType in (\"Interactive\",\"RemoteInteractive\")\r\n| where AccountName startswith \"svc\" or AccountName contains \"service\"\r\n| summarize\r\n    ['30d Local Admin Distinct Device Count']=dcountif(DeviceName,IsLocalAdmin == \"true\"),\r\n    ['30d Local Admin Device List']=make_set_if(DeviceName, IsLocalAdmin == \"true\")\r\n    by AccountName\r\n| sort by ['30d Local Admin Distinct Device Count'] desc;\r\n//comparison\r\nlet unique = DeviceLogonEvents\r\n| where TimeGenerated > ago(2d) and TimeGenerated < ago(1d)\r\n| where ActionType == \"LogonSuccess\"\r\n| where LogonType in (\"Interactive\",\"RemoteInteractive\")\r\n| where AccountName startswith \"svc\" or AccountName contains \"service\"\r\n| summarize\r\n    ['Devices Accessed']=dcountif(DeviceName,IsLocalAdmin == \"true\"),\r\n    ['Device Access List']=make_set_if(DeviceName, IsLocalAdmin == \"true\")\r\n    by AccountName\r\n| join kind=leftanti reference on AccountName\r\n| where ['Devices Accessed'] > 0\r\n| mv-expand ['Device Access List']\r\n| extend DeviceName = tostring(['Device Access List']);\r\n//Details of device signins\r\nDeviceLogonEvents\r\n| where TimeGenerated > ago(2d) and TimeGenerated < ago(1d)\r\n| join unique on AccountName, DeviceName\r\n| project TimeGenerated, ActionType, LogonType, IsLocalAdmin, ['Devices Accessed'], ['Device Access List'], AccountName, DeviceName, MachineGroup, InitiatingProcessAccountName, InitiatingProcessCommandLine",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "InitialAccess"
                ],
                "techniques": [
                    "T1078"
                ],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDescriptionFormat": "{{{AccountName}} was observed signing into {{DeviceName}} and this has not been seen in the last 30 days",
                    "alertDynamicProperties": []
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "AccountName"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "DeviceName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}