{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/96d84752-f452-47f2-8636-2d4ae4c26b0d')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/96d84752-f452-47f2-8636-2d4ae4c26b0d')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "_CSGP: AWS CloudTrail - Anomalous GetSecretValue-Medium",
                "description": "Retrieves a high number (5) of Secrets Manager secrets, through secretsmanager:GetSecretValue.\n\nHandling guidance: Review what actions the originating principle has done and check if that is normal activity by searching what the principle has access too, if it has modified anything, if least privileged is being utilized, see if secrets have any sensitive data, if unsure reach out to responsible team/person.",
                "severity": "Medium",
                "enabled": true,
                "query": "//Author: Samer Takieldin\r\n//Contributors: Samuel Liu\r\n//Source:  NA\r\n//Reviewer:\r\n//Description: This query identifies any role that is used to access 'GetSecretValue' more than 5 times in a short period of time \r\n//Handling guidance: Review what actions the originating principle has done and check if that is normal activity by searching what the principle has access too, if it has modified anything, if least privledge is being utilized, see if secerets have any sensitive data, if unsure reach out to responsible team/person. \r\n//\r\n//Change Log: \r\n//3/27/24 - added SAD detections instead of static detections, trains a baseline based on the past 7 days of data, then looks for outliers\r\n//01/28/2025 - Add VL exclusion based on sftp-lambda-idp since the lambda is a python script that interrogates a per-customer secretsmanager resource to validate credentials, allowing a customer to authenticate to their specific storage location in s3.\r\n//02/05/2025 - Add aws_vlsharedsvc_prd exclusion based on vl-shared-services-devops-jenkins-us-east-1 role since this role is assigned to a jenkins ECS setup in the AWS account, which is used by Customer Support team as an internal tool, with very spiky usage. The jenkins instances themselves are regularly looking up secrets.\r\nlet flatthreshold = 200;\r\nlet scorethreshold = 2.5;\r\nlet percentthreshold = 300;\r\nlet step_ = 1h;\r\nlet training_set = (\r\n    AWSCloudTrail\r\n    | where TimeGenerated > ago(7d)\r\n    | where EventName contains 'GetSecretValue'\r\n    | where UserIdentityArn !contains \"CSGPBuildAgentRole\"\r\n        and UserIdentityArn !contains \"CSGPDivvyCloudRole\"\r\n        and UserIdentityArn !contains \"central-preferences-client\"\r\n        and UserIdentityArn !contains \"ecsTaskExecutionRole\"\r\n        and UserIdentityArn !has \"jen2\"\r\n    | where UserIdentityArn !contains \"arn:aws:sts::405094702314:assumed-role/github_actions/GitHubActions\" and UserIdentityArn !contains \"clientdelivery-task-role-blue-tst\" //9/14/2023 - asahad - realla github role used for building anad managing infra from their private github\r\n    | extend request = parse_json(RequestParameters)\r\n    | extend parameter_arn = tostring(request.secretId)\r\n    //| distinct UserIdentityArn, parameter_arn, UserIdentityAccountId <- why distinct before summarize\r\n    //| summarize count() by UserIdentityArn, UserIdentityAccountId\r\n    //add SAD here:\r\n    | summarize Events=count_distinct(parameter_arn) by UserIdentityArn, UserIdentityAccountId, bin(TimeGenerated, step_)\r\n    | summarize EventCount=make_list(Events, 500), TimeGenerated=make_list(TimeGenerated, 500) by UserIdentityArn, UserIdentityAccountId\r\n    | extend (outliers, score, baseline) = series_decompose_anomalies(EventCount, scorethreshold, -1, \"linefit\") //anomaly detection with statistics\r\n    | mv-expand\r\n        TimeGenerated,\r\n        EventCount to typeof(long),\r\n        outliers,\r\n        baseline to typeof(long),\r\n        score to typeof(double)\r\n    );\r\ntraining_set\r\n| where todatetime(TimeGenerated) > ago(1d)\r\n| extend diff = EventCount - baseline\r\n| where outliers > 0 //filter for behavioral anomalies\r\n| join kind=inner _GetWatchlist('aws-accounts') on $left.UserIdentityAccountId == $right.accountid\r\n| where EventCount > 2\r\n| where UserIdentityArn !contains \"WizOrchestratorNode\" //wiz orchestrator node is authorized to perform getsecretvalue\r\n//| where score > 15\r\n//| where diff > 5\r\n| extend AccountName = name\r\n| where AccountName !contains \"payments\"\r\n    and AccountName !contains \"legacyhomes\"\r\n    and AccountName !contains \"hs\" //these accounts we allow them to pull secrets\r\n| where AccountName !has \"vl\" and (UserIdentityArn !has \"sftp-lambda-idp\" or UserIdentityArn !has \"vl-sftp-idp\")//01/28/2025 - Wajahat - Dave Williams confirmed the lambda is a python script that interrogates a per-customer secretsmanager resource to validate credentials, allowing a customer to authenticate to their specific storage location in s3.\r\n| where AccountName !has \"aws_vlsharedsvc_prd\" and UserIdentityArn !has \"vl-shared-services-devops-jenkins-us-east-1\"//02/05/2025 - Wajahat - Dave Williams confirmed that this role is assigned to a jenkins ECS setup in the AWS account, which is used by Customer Support team as an internal tool, with very spiky usage. The jenkins instances themselves are regularly looking up secrets\r\n| extend Workbook=\"https://portal.azure.com/#view/AppInsightsExtension/UsageNotebookBlade/ComponentId/%2Fsubscriptions%2F9ffb3684-fd6f-44dc-a39f-f5359f6ead6a%2Fresourcegroups%2Fsentinel-rg%2Fproviders%2Fmicrosoft.operationalinsights%2Fworkspaces%2Fcsgp-sentinel/ResourceIds~/%5B%5D/Type/sentinel/ConfigurationId/%2Fsubscriptions%2F9ffb3684-fd6f-44dc-a39f-f5359f6ead6a%2Fresourcegroups%2Fsentinel-rg%2Fproviders%2Fmicrosoft.insights%2Fworkbooks%2F9d9648b3-e88b-45f7-9b24-98ef259450b3/ViewerMode~/null/Source/Sentinel/GalleryResourceType/Sentinel/WorkbookTemplateName/_CSGP%3A%20AWS%20Cloudtrail%20Logs\"\r\n| project-reorder TimeGenerated, EventCount, baseline, score, UserIdentityArn",
                "queryFrequency": "P1D",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "Reconnaissance",
                    "CredentialAccess"
                ],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDescriptionFormat": "<b>Description: </b> Anomalous Retrieves a high number (5) of Secrets Manager secrets, through <i>secretsmanager:GetSecretValue</i>. Secrets can include credentials, API keys, or other sensitive information that's needed to access applications securely.\n\n<b>Guidance: </b> Review what actions the originating principle has done and check if that is normal activity by searching what the principle has access too, if it has modified anything, if least privileged is being utilized, see if secrets have any sensitive data, if unsure reach out to responsible team/person.\n",
                    "alertDynamicProperties": []
                },
                "customDetails": {
                    "AccountName": "name",
                    "UserIdentityArn": "UserIdentityArn",
                    "Workbook": "Workbook"
                },
                "entityMappings": [
                    {
                        "entityType": "CloudApplication",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "AccountName"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "UserIdentityArn"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}