{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/59db80b7-e7cd-4b00-ad31-ca1cf51398e5')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/59db80b7-e7cd-4b00-ad31-ca1cf51398e5')]",
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "kind": "Scheduled",
      "apiVersion": "2023-12-01-preview",
      "properties": {
        "displayName": "_DEV: SysInternals Abuse ",
        "description": "This alert identifies executions of Sysinternals utilities that have not been observed in the preceding 90 days. It compares recent executions to a baseline set of previously seen tools and highlights any new or uncommon usage for investigation.\n\nHandling Guidance: Initial Triage\n\nConfirm the user and device context.\n\nIdentify the tool and its execution path.\n\nReview the full command line and any initiating processes.\n\nDetermine Legitimacy\n\nContact the user or check change records for intended activity.\n\nValidate if the tool was used in response to a legitimate operational task.\n\nDeeper Investigation\n\nCheck for other suspicious activity around the time of execution (e.g., lateral movement, privilege escalation).\n\nInvestigate if the tool was downloaded recently or launched from a suspicious location.\n\nContain and Eradicate\n\nIf usage is unauthorized, isolate the host.\n\nReview system access and remove any unauthorized tools.",
        "severity": "Medium",
        "enabled": false,
        "query": "let SysInternalSuite = dynamic([\"accesschk.exe\",\"accesschk64.exe\",\"AccessEnum.exe\", \"AdExplorer.exe\",\"ADExplorer.exe\",\"ADExplorer64.exe\",\"ADInsight.chm\",\"ADInsight.exe\",\"ADInsight64.exe\",\"adrestore.exe\",\"adrestore64.exe\",\"Autologon.exe\",\"Autologon64.exe\",\"autoruns.chm\",\"Autoruns.exe\",\"Autoruns64.exe\",\"autorunsc.exe\",\"autorunsc64.exe\",\"Bginfo.exe\",\"Bginfo64.exe\",\"Cacheset.exe\",\"Cacheset64.exe\",\"Clockres.exe\",\"Clockres64.exe\",\"Contig.exe\",\"Contig64.exe\",\"Coreinfo.exe\",\"Coreinfo64.exe\",\"CPUSTRES.exe\",\"CPUSTRES64.exe\",\"ctrl2cap.amd.sys\",\"ctrl2cap.exe\",\"Dbgview.chm\",\"Dbgview.exe\",\"dbgview64.exe\",\"Desktops.exe\",\"Desktops64.exe\",\"Disk2vhd.chm\",\"disk2vhd.exe\",\"disk2vhd64.exe\",\"diskext.exe\",\"diskext64.exe\",\"Diskmon.exe\",\"Diskmon64.exe\",\"DiskView.exe\",\"DiskView64.exe\",\"du.exe\",\"du64.exe\",\"efsdump.exe\",\"Eula.txt\",\"FindLinks.exe\",\"FindLinks64.exe\",\"handle.exe\",\"handle64.exe\",\"hex2dec.exe\",\"hex2dec64.exe\",\"junction.exe\",\"junction64.exe\",\"ldmdump.exe\",\"Listdlls.exe\",\"Listdlls64.exe\",\"livekd.exe\",\"livekd64.exe\",\"LoadOrd.exe\",\"LoadOrd64.exe\",\"LoadOrdC.exe\",\"LoadOrdC64.exe\",\"logonsessions.exe\",\"logonsessions64.exe\",\"movefile.exe\",\"movefile64.exe\",\"notmyfault.exe\",\"notmyfault64.exe\",\"notmyfaultc.exe\",\"notmyfaultc64.exe\",\"ntfsinfo.exe\",\"ntfsinfo64.exe\",\"pendmoves.exe\",\"pendmoves64.exe\",\"pipelist.exe\",\"pipelist64.exe\",\"portmon.exe\",\"procdump.exe\",\"procdump64.exe\",\"procexp.chm\",\"procexp.exe\",\"procexp64.exe\",\"procmon.chm\",\"Procmon.exe\",\"Procmon64.exe\",\"PsExec.exe\",\"PsExec64.exe\",\"psfile.exe\",\"psfile64.exe\",\"PsGetsid.exe\",\"PsGetsid64.exe\",\"PsInfo.exe\",\"PsInfo64.exe\",\"pskill.exe\",\"pskill64.exe\",\"pslist.exe\",\"pslist64.exe\",\"PsLoggedon.exe\",\"PsLoggedon64.exe\",\"psloglist.exe\",\"psloglist64.exe\",\"pspasswd.exe\",\"pspasswd64.exe\",\"psping.exe\",\"psping64.exe\",\"PsService.exe\",\"PsService64.exe\",\"psshutdown.exe\",\"psshutdown64.exe\",\"pssuspend.exe\",\"pssuspend64.exe\",\"Pstools.chm\",\"psversion.txt\",\"RAMMap.exe\",\"RAMMap64.exe\",\"RDCMan.exe\",\"readme.txt\",\"RegDelNull.exe\",\"RegDelNull64.exe\",\"regjump.exe\",\"ru.exe\",\"ru64.exe\",\"sdelete.exe\",\"sdelete64.exe\",\"ShareEnum.exe\",\"ShareEnum64.exe\",\"ShellRunas.exe\",\"sigcheck.exe\",\"sigcheck64.exe\",\"streams.exe\",\"streams64.exe\",\"strings.exe\",\"strings64.exe\",\"sync.exe\",\"sync64.exe\",\"Sysmon.exe\",\"Sysmon64.exe\",\"tcpvcon.exe\",\"tcpvcon64.exe\",\"tcpview.chm\",\"tcpview.exe\",\"tcpview64.exe\",\"Testlimit.exe\",\"Testlimit64.exe\",\"Vmmap.chm\",\"vmmap.exe\",\"vmmap64.exe\",\"Volumeid.exe\",\"Volumeid64.exe\",\"whois.exe\",\"whois64.exe\",\"Winobj.exe\",\"Winobj64.exe\",\"ZoomIt.exe\",\"ZoomIt64.exe\"]);\nlet knownsysinternaltools = DeviceProcessEvents\n     | where FileName in~ (SysInternalSuite)\n     | where TimeGenerated between (ago(90d) .. ago(1d))\n     | distinct FileName;\nDeviceProcessEvents\n| where TimeGenerated > ago(1d)\n| where FileName in~ (SysInternalSuite) and FileName !in~ \n(knownsysinternaltools)\n| project\n     TimeGenerated,\n     DeviceName,\n     AccountDomain,\n     AccountName,\n     FileName,\n     ProcessCommandLine,\n     InitiatingProcessCommandLine,\n     FolderPath",
        "queryFrequency": "PT1H",
        "queryPeriod": "PT1H",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "suppressionDuration": "PT5H",
        "suppressionEnabled": false,
        "startTimeUtc": null,
        "tactics": [
          "Execution",
          "Discovery"
        ],
        "techniques": [
          "T0807",
          "T1057"
        ],
        "subTechniques": [],
        "alertRuleTemplateName": null,
        "incidentConfiguration": {
          "createIncident": true,
          "groupingConfiguration": {
            "enabled": true,
            "reopenClosedIncident": false,
            "lookbackDuration": "PT5H",
            "matchingMethod": "AllEntities",
            "groupByEntities": [
              "Host",
              "File",
              "Process"
            ],
            "groupByAlertDetails": [
              "DisplayName",
              "Severity"
            ],
            "groupByCustomDetails": []
          }
        },
        "eventGroupingSettings": {
          "aggregationKind": "SingleAlert"
        },
        "alertDetailsOverride": {
          "alertDynamicProperties": []
        },
        "customDetails": {},
        "entityMappings": [
          {
            "entityType": "Host",
            "fieldMappings": [
              {
                "identifier": "FullName",
                "columnName": "AccountName"
              }
            ]
          },
          {
            "entityType": "File",
            "fieldMappings": [
              {
                "identifier": "Name",
                "columnName": "FileName"
              }
            ]
          },
          {
            "entityType": "Process",
            "fieldMappings": [
              {
                "identifier": "CommandLine",
                "columnName": "ProcessCommandLine"
              }
            ]
          }
        ],
        "sentinelEntitiesMappings": null,
        "templateVersion": null
      }
    }
  ]
}